adafruit/seesaw/lib/samd51/samd51a/edc/ATSAMD51J19A.PIC
      <edc:SFRDef edc:_addr="0xE000EF44" edc:access="rrrrrrrr----------------rrrrrrrr" edc:cname="MVFR1" edc:impl="0xFF0000FF" edc:nzwidth="0x20" ltx:memberofperipheral="FPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPU">
            <edc:SFRFieldDef edc:cname="FtZ_mode" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="D_NaN_mode" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x10"/>
            <edc:SFRFieldDef edc:cname="FP_HPFP" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="FP_fused_MAC" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE000EF48" edc:offset="0x310B8"/>
      <edc:SFRDef edc:_addr="0xE0040000" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="SSPSR" edc:nzwidth="0x20" ltx:memberofperipheral="TPI"/>
      <edc:SFRDef edc:_addr="0xE0040004" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CSPSR" edc:nzwidth="0x20" ltx:memberofperipheral="TPI"/>
      <edc:AdjustPoint edc:_addr="0xE0040008" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0xE0040010" edc:access="-------------------nnnnnnnnnnnnn" edc:cname="ACPR" edc:impl="0x1FFF" edc:nzwidth="0x20" ltx:memberofperipheral="TPI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TPI">
            <edc:SFRFieldDef edc:cname="PRESCALER" edc:nzwidth="0xD"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE0040014" edc:offset="0xDC"/>
      <edc:SFRDef edc:_addr="0xE00400F0" edc:access="------------------------------nn" edc:cname="SPPR" edc:impl="0x3" edc:nzwidth="0x20" ltx:memberofperipheral="TPI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TPI">
            <edc:SFRFieldDef edc:cname="TXMODE" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE00400F4" edc:offset="0x20C"/>
      <edc:SFRDef edc:_addr="0xE0040300" edc:access="----------------------------rrrr" edc:cname="FFSR" edc:impl="0xF" edc:nzwidth="0x20" ltx:memberofperipheral="TPI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TPI">
            <edc:SFRFieldDef edc:cname="FlInProg" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FtStopped" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCPresent" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FtNonStop" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0040304" edc:access="-----------------------n------n-" edc:cname="FFCR" edc:impl="0x102" edc:nzwidth="0x20" ltx:memberofperipheral="TPI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TPI">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EnFCont" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="TrigIn" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0040308" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="FSCR" edc:nzwidth="0x20" ltx:memberofperipheral="TPI"/>
      <edc:AdjustPoint edc:_addr="0xE004030C" edc:offset="0xBDC"/>
      <edc:SFRDef edc:_addr="0xE0040EE8" edc:access="-------------------------------r" edc:cname="TRIGGER" edc:impl="0x1" edc:nzwidth="0x20" ltx:memberofperipheral="TPI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TPI">
            <edc:SFRFieldDef edc:cname="TRIGGER" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0040EEC" edc:access="--rrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="FIFO0" edc:impl="0x3FFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="TPI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TPI">
            <edc:SFRFieldDef edc:cname="ETM0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="ETM1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="ETM2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="ETM_bytecount" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ETM_ATVALID" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ITM_bytecount" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ITM_ATVALID" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0040EF0" edc:access="-------------------------------r" edc:cname="ITATBCTR2" edc:impl="0x1" edc:nzwidth="0x20" ltx:memberofperipheral="TPI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TPI">
            <edc:SFRFieldDef edc:cname="ATREADY" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE0040EF4" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0xE0040EF8" edc:access="-------------------------------r" edc:cname="ITATBCTR0" edc:impl="0x1" edc:nzwidth="0x20" ltx:memberofperipheral="TPI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TPI">
            <edc:SFRFieldDef edc:cname="ATREADY" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0040EFC" edc:access="--rrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="FIFO1" edc:impl="0x3FFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="TPI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TPI">
            <edc:SFRFieldDef edc:cname="ITM0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="ITM1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="ITM2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="ETM_bytecount" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ETM_ATVALID" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ITM_bytecount" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ITM_ATVALID" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
